'''
На шахматной доске 8×8 стоит конь. Напишите программу, которая отмечает положение коня на доске и все клетки, которые бьет конь. Клетку, где стоит конь, отметьте английской буквой N, а клетки, которые бьет конь, отметьте символами *, остальные клетки заполните точками.
'''
#код
par=input()
y='abcdefgh'.index(par[0])
x='87654321'.index(par[1])
mat=[['.' for i in range(8)] for j in range(8)]
mat[x][y]='N'
for i in range(8):
    for j in range(8):
        if (((x-2)==i or (x+2)==i) and ((y-1)==j or (y+1)==j) ) or (((x-1)==i or (x+1)==i) and ((y-2)==j or (y+2)==j) ):
            mat[i][j]='*'
[print(*row) for row in mat]


