"""
Дана квадратная матрица чисел. Напишите программу, которая меняет местами элементы, стоящие на главной и побочной диагонали,
при этом каждый элемент должен остаться в том же столбце (то есть в каждом столбце нужно поменять местами элемент на главной диагонали и на побочной диагонали).
"""
#код
n=int(input())
mat=[input().split() for i in range(n)]
for i in range(n):
    for j in range(n):
        if i==j:
            mat[i][j],mat[n-1-j][j]=mat[n-1-j][j],mat[i][j]
[print(*row) for row in mat]
