"""
На вход программе подаются два натуральных числа 
n
n и 
m
m, каждое на отдельной строке – количество строк и столбцов в матрице. Далее вводятся сами элементы матрицы – слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и так далее.

Напишите программу, которая сначала считывает элементы матрицы один за другим, затем выводит их в виде матрицы.
"""
#код
n,m=int(input()),int(input())
mat = [[input() for i in range(m)] for _ in range(n)] 
for r in mat:
    print(*r)
