"""
На вход программе подаются два натуральных числа n и m – количество строк и столбцов в матрице. Создайте матрицу mult размером n×mn×m и заполните ее таблицей умножения по формуле mult[i][j] = i * j.

Формат входных данных: На вход программе на разных строках подаются два числа n и m – количество строк и столбцов в матрице.
"""
#код
n=int(input())
m=int(input())
mult=[[str(i*j).ljust(3) for i in range(m)] for j in range(n)]
for r in range(n):
    for c in range(m):
        print(mult[r][c], end='')
    print()
