"""
На вход программе подаются два натуральных числа 
n
n и 
m
m, каждое на отдельной строке — количество строк и столбцов в матрице. Далее вводятся сами элементы матрицы – слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и так далее.

Напишите программу, которая считывает элементы матрицы один за другим, выводит их в виде матрицы, выводит пустую строку, и снова ту же матрицу, но уже поменяв местами строки со столбцами: первая строка выводится как первый столбец, и так далее.
"""
n,m=int(input()),int(input())
mat = [[input() for i in range(m)] for _ in range(n)] 
for r in mat:
    print(*r)
print()
for s in range(m):
    for r in range(n):
        print(mat[r][s],end=' ')
    print()
